ERP.belugaerp/src/Documents/битСертификацияНоменклатуры/битСертификацияНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битСертификацияНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТиповойАнализ</name>
    <type>
      <types>CatalogRef.бг_ТиповыеАнализыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатСертификации</name>
    <type>
      <types>EnumRef.бг_РезультатыСертификации</types>
    </type>
  </attributes>
  <attributes>
    <name>НормативныйДокумент</name>
    <type>
      <types>CatalogRef.бг_НормативныеДокументыСертификацииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСертификата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОкончанияДействияСертификата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПартии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственнаяЛиния</name>
    <type>
      <types>CatalogRef.бг_ПроизводственныеЛинии</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Анализы</name>
    <attributes>
      <name>ТиповойАнализ</name>
      <type>
        <types>CatalogRef.бг_ТиповыеАнализыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.бг_ПоказателиАнализовНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРезультата</name>
      <type>
        <types>EnumRef.бг_ВидыРезультатовЛабораторныхАнализов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.бг_ЗначенияПоказателейАнализовНоменклатуры</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СоответствуетНормативу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МинимальноеНормативноеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальноеНормативноеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Enums/бг_ВидыРезультатовЛабораторныхАнализов/бг_ВидыРезультатовЛабораторныхАнализов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ВидыРезультатовЛабораторныхАнализов</name>
  <enumValues>
    <name>ЗначениеСПогрешностью</name>
  </enumValues>
  <enumValues>
    <name>ЗначениеИзСписка</name>
  </enumValues>
  <enumValues>
    <name>Поддиапазон</name>
  </enumValues>
  <enumValues>
    <name>ЧислоВИнтервале</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_ТипыЛицензийПоставщиковАлкогольнойПродукции/бг_ТипыЛицензийПоставщиковАлкогольнойПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ТипыЛицензийПоставщиковАлкогольнойПродукции</name>
  <enumValues>
    <name>Импорт</name>
    <comment>Лицензия на импорт</comment>
  </enumValues>
  <enumValues>
    <name>Оптовая</name>
  </enumValues>
  <enumValues>
    <name>Перевозка</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>Розничная</name>
  </enumValues>
  <enumValues>
    <name>Хранение</name>
    <comment>Лицензия на хранение алкоголя</comment>
  </enumValues>
  <enumValues>
    <name>Экспорт</name>
    <comment>Лицензия на экспорт алкоголя</comment>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_ТипыЕдиницИзмерения/бг_ТипыЕдиницИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ТипыЕдиницИзмерения</name>
  <enumValues>
    <name>Бутылка</name>
  </enumValues>
  <enumValues>
    <name>Коробка</name>
  </enumValues>
  <enumValues>
    <name>Паллета</name>
  </enumValues>
  <enumValues>
    <name>Дал</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Documents/ДвижениеПродукцииИМатериалов/ДвижениеПродукцииИМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ДвижениеПродукцииИМатериалов</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностямВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностям</registerRecords>
  <registerRecords>InformationRegister.бг_ДвижениеМарок</registerRecords>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>бг_СписаниеПотерь</name>
    <type>
      <types>DocumentRef.битСписаниеПотерь</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_АкцизПоПриобретеннымЦенностям</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>CatalogRef.бг_БанковскиеГарантии</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСырья</name>
      <type>
        <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАкциза</name>
      <type>
        <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПродукции</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОплатыАванса</name>
      <type>
        <types>CatalogRef.бг_СостоянияОплатыАванса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_ДанныеФСМ</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Разряд</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДиапазона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецДиапазона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Catalogs/бг_ТиповыеАнализыНоменклатуры/бг_ТиповыеАнализыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бг_ТиповыеАнализыНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <tabularSections>
    <name>ПоказателиАнализа</name>
    <attributes>
      <name>ПоказательАнализа</name>
      <type>
        <types>CatalogRef.бг_ПоказателиАнализовНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/бг_ПоказателиАнализовНоменклатуры/бг_ПоказателиАнализовНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бг_ПоказателиАнализовНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидРезультата</name>
    <type>
      <types>EnumRef.бг_ВидыРезультатовЛабораторныхАнализов</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДопустимыеЗначенияПоказателей</name>
    <attributes>
      <name>ЗначениеПоказателя</name>
      <type>
        <types>CatalogRef.бг_ЗначенияПоказателейАнализовНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/ЛицензииПоставщиковАлкогольнойПродукции/ЛицензииПоставщиковАлкогольнойПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЛицензииПоставщиковАлкогольнойПродукции</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Контрагенты</owners>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>бг_ВидЛицензируемойДеятельности</name>
    <type>
      <types>CatalogRef.бг_ВидыЛицензируемойДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДатаПрекращенияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЗаменяемаяЛицензия</name>
    <type>
      <types>CatalogRef.ЛицензииПоставщиковАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_НомерРАР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ПриостановленаСДаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Регион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_СлабоалкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипЛицензии</name>
    <type>
      <types>EnumRef.бг_ТипыЛицензийПоставщиковАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Хорека</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЛицензии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>бг_ВидыАлкогольнойПродукции</name>
    <attributes>
      <name>ВидАлкогольнойПродукции</name>
      <type>
        <types>CatalogRef.ВидыАлкогольнойПродукции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_ПунктыНазначения</name>
    <attributes>
      <name>ВладелецПунктаНазначения</name>
      <type>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктНазначения</name>
      <type>
        <types>CatalogRef.битПунктыНазначения</types>
      </type>
    </attributes>
    <attributes>
      <name>СлабоалкогольнаяПродукция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/Documents/битСертификацияНоменклатуры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ТаблицаАнализовДляСертификации(ТиповойАнализ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТиповыеАнализыПоказатели.Ссылка КАК ТиповойАнализ,
	|	ТиповыеАнализыПоказатели.ПоказательАнализа КАК Показатель,
	|	ПоказателиАнализовНоменклатуры.МинимальноеЗначение КАК МинимальноеНормативноеЗначение,
	|	ПоказателиАнализовНоменклатуры.МаксимальноеЗначение КАК МаксимальноеНормативноеЗначение,
	|	ПоказателиАнализовНоменклатуры.ВидРезультата КАК ВидРезультата,
	|	ЕСТЬNULL(ДопустимыеЗначения.ЗначениеПоказателя, 0) КАК Значение,
	|	ВЫБОР
	|		КОГДА НЕ ДопустимыеЗначения.ЗначениеПоказателя ЕСТЬ NULL
	|				ИЛИ ПоказателиАнализовНоменклатуры.МинимальноеЗначение = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СоответствуетНормативу
	|ИЗ
	|	Справочник.бг_ТиповыеАнализыНоменклатуры.ПоказателиАнализа КАК ТиповыеАнализыПоказатели
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бг_ПоказателиАнализовНоменклатуры КАК ПоказателиАнализовНоменклатуры
	|		ПО (ТиповыеАнализыПоказатели.Ссылка = &ТиповойАнализ)
	|			И ТиповыеАнализыПоказатели.ПоказательАнализа = ПоказателиАнализовНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бг_ПоказателиАнализовНоменклатуры.ДопустимыеЗначенияПоказателей КАК ДопустимыеЗначения
	|		ПО ТиповыеАнализыПоказатели.ПоказательАнализа = ДопустимыеЗначения.Ссылка
	|			И (ДопустимыеЗначения.Ссылка.ВидРезультата = ЗНАЧЕНИЕ(Перечисление.бг_ВидыРезультатовЛабораторныхАнализов.ЗначениеИзСписка))
	|			И (ДопустимыеЗначения.НомерСтроки = 1)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоказателиАнализовНоменклатуры.Родитель.Наименование,
	|	ПоказателиАнализовНоменклатуры.Наименование";
	Запрос.УстановитьПараметр("ТиповойАнализ", ТиповойАнализ);
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.битСертификацияНоменклатуры) Тогда
		
		// Качественное удостоверение
		Обработки.бг_ПечатьКачественногоУдостоверения.ДобавитьКомандуПечати(КомандыПечати);
		
	КонецЕсли;
		
КонецПроцедуры

Функция бг_ДанныеДляПечатнойФормыКачественногоУдостоверения(ПараметрыПечати, МассивОбъектов) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СертификацияНоменклатуры.Ссылка КАК Документ,
	|	СертификацияНоменклатуры.Организация КАК Организация,
	|	СертификацияНоменклатуры.Номенклатура КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	СертификацияНоменклатуры.Серия КАК Серия,
	|	СертификацияНоменклатуры.Ссылка КАК ДокументСертификации,
	|	СертификацияНоменклатуры.Номер КАК НомерСертификата,
	|	СертификацияНоменклатуры.НормативныйДокумент КАК ГОСТ,
	|	СертификацияНоменклатуры.ДатаСертификата КАК ДатаСертификата,
	|	СертификацияНоменклатуры.Ответственный КАК Автор
	|ПОМЕСТИТЬ НоменклатураСертификации
	|ИЗ
	|	Документ.битСертификацияНоменклатуры КАК СертификацияНоменклатуры
	|ГДЕ
	|	СертификацияНоменклатуры.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лицензии.Владелец КАК Организация,
	|	Лицензии.Ссылка КАК Ссылка,
	|	Лицензии.бг_Серия КАК ЛицензияНаПроизводствоСерия,
	|	Лицензии.бг_Номер КАК ЛицензияНаПроизводствоНомер,
	|	Лицензии.бг_ДатаВыдачи КАК ЛицензияНаПроизводствоДатаВыдачи,
	|	Лицензии.ДатаНачала КАК ЛицензияНаПроизводствоДатаНачалаСрокаДействия,
	|	Лицензии.ДатаОкончания КАК ЛицензияНаПроизводствоДатаОкончанияСрокаДействия,
	|	Лицензии.КемВыдана КАК ЛицензияНаПроизводствоОрганВыдачи,
	|	Лицензии.бг_ВидЛицензируемойДеятельности КАК ВидЛицензируемойДеятельности,
	|	Лицензии.бг_ВидЛицензируемойДеятельности.Примечание КАК ВидЛицензируемойДеятельностиПримечание,
	|	Лицензии.бг_ВидЛицензируемойДеятельности.Наименование КАК ВидЛицензируемойДеятельностиНаименование
	|ПОМЕСТИТЬ ЛицензииОрганизаций
	|ИЗ
	|	Справочник.ЛицензииПоставщиковАлкогольнойПродукции КАК Лицензии
	|ГДЕ
	|	Лицензии.Владелец В
	|			(ВЫБРАТЬ
	|				НоменклатураСертификации.Организация
	|			ИЗ
	|				НоменклатураСертификации
	|			ГДЕ
	|				НоменклатураСертификации.Документ.Дата < Лицензии.бг_ДатаПрекращенияДействия)
	|	И Лицензии.бг_ТипЛицензии = ЗНАЧЕНИЕ(Перечисление.бг_ТипыЛицензийПоставщиковАлкогольнойПродукции.Производство)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтветственныеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ОтветственныеЛица.СсылкаОтветственноеЛицо КАК СсылкаОтветственноеЛицо
	|ПОМЕСТИТЬ ДоверенностиОтветственныхЛиц
	|ИЗ
	|	(ВЫБРАТЬ
	|		Пользователи.ФизическоеЛицо КАК ФизическоеЛицо,
	|		МАКСИМУМ(ОтветственныеЛицаОрганизаций.Ссылка) КАК СсылкаОтветственноеЛицо
	|	ИЗ
	|		НоменклатураСертификации КАК НоменклатураСертификации
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
	|				ПО Пользователи.ФизическоеЛицо = ОтветственныеЛицаОрганизаций.ФизическоеЛицо
	|			ПО НоменклатураСертификации.Автор = Пользователи.Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Пользователи.ФизическоеЛицо) КАК ОтветственныеЛица
	|ГДЕ
	|	ОтветственныеЛица.ФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвижениеПродукцииИМатериаловТовары.Серия КАК Серия,
	|	СУММА(ДвижениеПродукцииИМатериаловТовары.Количество) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА СерииНоменклатуры.бг_УпаковкаПаллета.ЕдиницаИзмерения.бг_ТипЕдиницыИзмерения = ЗНАЧЕНИЕ(Перечисление.бг_ТипыЕдиницИзмерения.Паллета)
	|					И СерииНоменклатуры.бг_УпаковкаПаллета.Родитель.ЕдиницаИзмерения.бг_ТипЕдиницыИзмерения = ЗНАЧЕНИЕ(Перечисление.бг_ТипыЕдиницИзмерения.Коробка)
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(СерииНоменклатуры.бг_УпаковкаПаллета.Родитель.КоличествоУпаковок, 0) <> 0
	|							ТОГДА ДвижениеПродукцииИМатериаловТовары.Количество / СерииНоменклатуры.бг_УпаковкаПаллета.Родитель.КоличествоУпаковок
	|					КОНЕЦ
	|			КОГДА СерииНоменклатуры.бг_УпаковкаПаллета.ЕдиницаИзмерения.бг_ТипЕдиницыИзмерения = ЗНАЧЕНИЕ(Перечисление.бг_ТипыЕдиницИзмерения.Коробка)
	|					И СерииНоменклатуры.бг_УпаковкаПаллета.Родитель.ЕдиницаИзмерения.бг_ТипЕдиницыИзмерения = ЗНАЧЕНИЕ(Перечисление.бг_ТипыЕдиницИзмерения.Бутылка)
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(СерииНоменклатуры.бг_УпаковкаПаллета.КоличествоУпаковок, 0) <> 0
	|							ТОГДА ДвижениеПродукцииИМатериаловТовары.Количество / СерииНоменклатуры.бг_УпаковкаПаллета.КоличествоУпаковок
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КолМест
	|ПОМЕСТИТЬ ПроизведеннаяПродукция
	|ИЗ
	|	Документ.ДвижениеПродукцииИМатериалов.Товары КАК ДвижениеПродукцииИМатериаловТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДвижениеПродукцииИМатериалов КАК ДвижениеПродукцииИМатериалов
	|		ПО ДвижениеПродукцииИМатериаловТовары.Ссылка = ДвижениеПродукцииИМатериалов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО ДвижениеПродукцииИМатериаловТовары.Серия = СерииНоменклатуры.Ссылка
	|ГДЕ
	|	ДвижениеПродукцииИМатериалов.Проведен
	|	И ДвижениеПродукцииИМатериаловТовары.Серия В
	|			(ВЫБРАТЬ
	|				НоменклатураСертификации.Серия
	|			ИЗ
	|				НоменклатураСертификации КАК НоменклатураСертификации)
	|	И ДвижениеПродукцииИМатериалов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвижениеПродукцииИМатериаловТовары.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураСертификации.Документ КАК Документ,
	|	НоменклатураСертификации.Документ.Дата КАК ДатаДокумента,
	|	НоменклатураСертификации.Документ.Номер КАК НомерДокумента,
	|	НоменклатураСертификации.Организация КАК Организация,
	|	НоменклатураСертификации.Номенклатура КАК Номенклатура,
	|	НоменклатураСертификации.Номенклатура.НаименованиеПолное КАК НаименованиеТовара,
	|	НоменклатураСертификации.Характеристика КАК ХарактеристикаНоменклатуры,
	|	СерииНоменклатуры.Ссылка КАК Серия,
	|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияНаименование,
	|	ВидыНоменклатуры.бг_ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
	|	СпрНоменклатура.бг_КонтрагентПроизводитель КАК Производитель,
	|	СпрНоменклатура.бг_ОписаниеСоставаПродукта КАК СоставПродукта,
	|	СпрНоменклатура.бг_УсловияТранспортирования КАК УсловияТранспортирования,
	|	ЕСТЬNULL(ПроизведеннаяПродукция.Количество, 1) КАК Количество,
	|	ЕСТЬNULL(ПроизведеннаяПродукция.КолМест, 1) КАК КолМест,
	|	СпрНоменклатура.бг_АнализыДляУдостоверенияОКачестве КАК АнализыДляУдостоверенияОКачестве,
	|	СпрНоменклатура.ВидАлкогольнойПродукции.Код КАК КодАлкогольнойПродукции,
	|	ВЫБОР
	|		КОГДА СерииНоменклатуры.бг_Сертификат.ТипСертификата = &СертификатСоответствия
	|			ТОГДА СерииНоменклатуры.бг_Сертификат
	|	КОНЕЦ КАК СертификатСоответствия,
	|	СерииНоменклатуры.бг_Сертификат.ТипСертификата КАК ТипСертификата,
	|	ВЫБОР
	|		КОГДА СертификатыНоменклатуры.ТипСертификата = &СертификатСоответствия
	|			ТОГДА СертификатыНоменклатуры.Номер
	|	КОНЕЦ КАК НомерСертификатаСоответствия,
	|	ВЫБОР
	|		КОГДА СертификатыНоменклатуры.ТипСертификата = &СертификатСоответствия
	|			ТОГДА СертификатыНоменклатуры.ОрганВыдавшийДокумент
	|	КОНЕЦ КАК ОрганВыдачиСертификатаСоответствия,
	|	ВЫБОР
	|		КОГДА СертификатыНоменклатуры.ТипСертификата = &СертификатСоответствия
	|			ТОГДА СертификатыНоменклатуры.ДатаНачалаСрокаДействия
	|	КОНЕЦ КАК ДатаВыдачиСертификатСоответствия,
	|	ВЫБОР
	|		КОГДА СертификатыНоменклатуры.ТипСертификата = &СертификатСоответствия
	|			ТОГДА СертификатыНоменклатуры.ДатаОкончанияСрокаДействия
	|	КОНЕЦ КАК ДатаОкончанияСрокаДействияСертификата,
	|	ВЫБОР
	|		КОГДА СертификатыНоменклатуры.ТипСертификата = &СертификатСоответствия
	|			ТОГДА ВЫБОР
	|					КОГДА СертификатыНоменклатуры.Бессрочный
	|						ТОГДА 0
	|					ИНАЧЕ РАЗНОСТЬДАТ(СертификатыНоменклатуры.ДатаНачалаСрокаДействия, СертификатыНоменклатуры.ДатаОкончанияСрокаДействия, МЕСЯЦ)
	|				КОНЕЦ
	|	КОНЕЦ КАК СрокДействияСертификата,
	|	ВЫБОР
	|		КОГДА СертификатыНоменклатуры.ТипСертификата = &ДекларацияОСоответствии
	|			ТОГДА СертификатыНоменклатуры.Ссылка
	|	КОНЕЦ КАК ДекларацияОСоответствии,
	|	ВЫБОР
	|		КОГДА СертификатыНоменклатуры.ТипСертификата = &ДекларацияОСоответствии
	|			ТОГДА СертификатыНоменклатуры.Номер
	|	КОНЕЦ КАК НомерДекларацииОСоответствии,
	|	ВЫБОР
	|		КОГДА СертификатыНоменклатуры.ТипСертификата = &ДекларацияОСоответствии
	|			ТОГДА СертификатыНоменклатуры.ОрганВыдавшийДокумент
	|	КОНЕЦ КАК ОрганВыдачиДекларацииОСоответствии,
	|	ВЫБОР
	|		КОГДА СертификатыНоменклатуры.ТипСертификата = &ДекларацияОСоответствии
	|			ТОГДА СертификатыНоменклатуры.ДатаНачалаСрокаДействия
	|	КОНЕЦ КАК ДатаВыдачиДекларацииОСоответствии,
	|	ВЫБОР
	|		КОГДА СертификатыНоменклатуры.ТипСертификата = &ДекларацияОСоответствии
	|			ТОГДА СертификатыНоменклатуры.ДатаОкончанияСрокаДействия
	|	КОНЕЦ КАК ДатаОкончанияСрокаДействияДекларации,
	|	ВЫБОР
	|		КОГДА СертификатыНоменклатуры.ТипСертификата = &ДекларацияОСоответствии
	|			ТОГДА ВЫБОР
	|					КОГДА СертификатыНоменклатуры.Бессрочный
	|						ТОГДА 0
	|					ИНАЧЕ РАЗНОСТЬДАТ(СертификатыНоменклатуры.ДатаНачалаСрокаДействия, СертификатыНоменклатуры.ДатаОкончанияСрокаДействия, МЕСЯЦ)
	|				КОНЕЦ
	|	КОНЕЦ КАК СрокДействияДекларацииОСоответствии,
	|	ЛицензииОрганизаций.Ссылка КАК ЛицензияНаПроизводство,
	|	ЛицензииОрганизаций.ЛицензияНаПроизводствоСерия КАК ЛицензияНаПроизводствоСерия,
	|	ЛицензииОрганизаций.ЛицензияНаПроизводствоНомер КАК ЛицензияНаПроизводствоНомер,
	|	ЛицензииОрганизаций.ЛицензияНаПроизводствоДатаВыдачи КАК ЛицензияНаПроизводствоДатаВыдачи,
	|	ЛицензииОрганизаций.ЛицензияНаПроизводствоДатаНачалаСрокаДействия КАК ЛицензияНаПроизводствоДатаНачалаСрокаДействия,
	|	ЛицензииОрганизаций.ЛицензияНаПроизводствоДатаОкончанияСрокаДействия КАК ЛицензияНаПроизводствоДатаОкончанияСрокаДействия,
	|	ЛицензииОрганизаций.ЛицензияНаПроизводствоОрганВыдачи КАК ЛицензияНаПроизводствоОрганВыдачи,
	|	ЛицензииОрганизаций.ВидЛицензируемойДеятельности КАК ВидЛицензируемойДеятельности,
	|	ЛицензииОрганизаций.ВидЛицензируемойДеятельностиПримечание КАК ВидЛицензируемойДеятельностиПримечание,
	|	ЛицензииОрганизаций.ВидЛицензируемойДеятельностиНаименование КАК ВидЛицензируемойДеятельностиНаименование,
	|	НоменклатураСертификации.ДокументСертификации КАК ДокументСертификации,
	|	НоменклатураСертификации.ГОСТ КАК ГОСТ,
	|	НоменклатураСертификации.ДатаСертификата КАК ДатаСертификата,
	|	НоменклатураСертификации.НомерСертификата КАК НомерСертификата,
	|	СерииНоменклатуры.ДатаПроизводства КАК ДатаРозлива,
	|	ФизическиеЛица.Ссылка КАК Ответственный,
	|	ФизическиеЛица.бг_Должность КАК Должность,
	|	ОтветственныеЛицаОрганизаций.НомерДокументаПраваПодписи КАК НомерОснования,
	|	ОтветственныеЛицаОрганизаций.ДатаДокументаПраваПодписи КАК ДатаОснования,
	|	ОтветственныеЛицаОрганизаций.Ссылка КАК ОтветственноеЛицо,
	|	ЕСТЬNULL(ОтветственныеЛицаОрганизаций.ДокументПраваПодписи, НЕОПРЕДЕЛЕНО) КАК ДокументПраваПодписи,
	|	НоменклатураСертификации.Организация КАК Контрагент,
	|	СпрНоменклатура.ОбъемДАЛ * 10 КАК Емкость,
	|	ВЫРАЗИТЬ(СерииНоменклатуры.ПроизводительЕГАИС.Контрагент КАК Справочник.Организации) КАК ПроизводительЕГАИСОрганизация
	|ИЗ
	|	НоменклатураСертификации КАК НоменклатураСертификации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СертификатыНоменклатуры КАК СертификатыНоменклатуры
	|			ПО (СерииНоменклатуры.бг_Сертификат = СертификатыНоменклатуры.Ссылка)
	|		ПО (НоменклатураСертификации.Серия = СерииНоменклатуры.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО (СпрНоменклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка)
	|		ПО (НоменклатураСертификации.Номенклатура = СпрНоменклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЛицензииОрганизаций КАК ЛицензииОрганизаций
	|		ПО (НоменклатураСертификации.Организация = ЛицензииОрганизаций.Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|				ЛЕВОЕ СОЕДИНЕНИЕ ДоверенностиОтветственныхЛиц КАК ДоверенностиОтветственныхЛиц
	|					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
	|					ПО (ДоверенностиОтветственныхЛиц.СсылкаОтветственноеЛицо = ОтветственныеЛицаОрганизаций.Ссылка)
	|				ПО (ФизическиеЛица.Ссылка = ДоверенностиОтветственныхЛиц.ФизическоеЛицо)
	|			ПО (Пользователи.ФизическоеЛицо = ФизическиеЛица.Ссылка)
	|		ПО (НоменклатураСертификации.Автор = Пользователи.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроизведеннаяПродукция КАК ПроизведеннаяПродукция
	|		ПО (НоменклатураСертификации.Серия = ПроизведеннаяПродукция.Серия)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ
	|ИТОГИ ПО
	|	Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураСертификации.Номенклатура КАК Номенклатура,
	|	СпрНоменклатура.бг_ФайлПиктограммы КАК ПрисоединенныйФайл
	|ИЗ
	|	НоменклатураСертификации КАК НоменклатураСертификации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО НоменклатураСертификации.Номенклатура = СпрНоменклатура.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураСертификации.Номенклатура,
	|	СпрНоменклатура.бг_ФайлПиктограммы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураСертификации.Документ КАК Документ,
	|	СертификацияНоменклатурыАнализы.Ссылка КАК ДокументСертификации,
	|	НоменклатураСертификации.Номенклатура КАК Номенклатура,
	|	НоменклатураСертификации.Серия КАК Серия,
	|	СертификацияНоменклатурыАнализы.ТиповойАнализ КАК ТиповойАнализ,
	|	СертификацияНоменклатурыАнализы.Показатель КАК Показатель,
	|	СертификацияНоменклатурыАнализы.ВидРезультата КАК ВидРезультата,
	|	СертификацияНоменклатурыАнализы.Значение КАК Значение,
	|	СертификацияНоменклатурыАнализы.СоответствуетНормативу КАК СоответствуетНормативу,
	|	СертификацияНоменклатурыАнализы.МинимальноеНормативноеЗначение КАК МинимальноеНормативноеЗначение,
	|	СертификацияНоменклатурыАнализы.МаксимальноеНормативноеЗначение КАК МаксимальноеНормативноеЗначение
	|ИЗ
	|	НоменклатураСертификации КАК НоменклатураСертификации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.битСертификацияНоменклатуры.Анализы КАК СертификацияНоменклатурыАнализы
	|		ПО НоменклатураСертификации.Документ = СертификацияНоменклатурыАнализы.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураСертификации.Документ,
	|	СертификацияНоменклатурыАнализы.НомерСтроки";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("СертификатСоответствия", "Сертификат соответствия");
	Запрос.УстановитьПараметр("ДекларацияОСоответствии", "Декларация о соответствии");
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	ДанныеДляПечати = Новый Структура;
	
	ДанныеДляПечати.Вставить("СведенияПоДокументам", 	ПакетРезультатов[4]);
	ДанныеДляПечати.Вставить("ПиктограммыНоменклатуры", ПакетРезультатов[5]);
	ДанныеДляПечати.Вставить("РезультатыАнализа", 		ПакетРезультатов[6]);
	
	Возврат ДанныеДляПечати; 
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
